mServer/app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('junaid@example.com', '$2a$10$4biRjWLhLQRnd7VKgViUkOI3pGNCEMK.Uuwz0RNjk5s0XDbmYghEe', '2017-11-21 11:50:08', '2017-11-21 11:50:08')