reactApplication/app/controllers/api/events_controller.rb

		def index
      		render json: Event.all
---
SELECT `events`.* FROM `events` ORDER BY description desc

    	def create
    		event = Event.new(event_params)
    		if event.save
---
INSERT INTO `events` (`name`, `event_date`, `description`, `place`, `created_at`, `updated_at`) VALUES ('Oppo F5 6GB', '2017-11-14', 'Gogle is Bad', 'Lahore', '2017-11-20 11:50:47', '2017-11-20 11:50:47')

    	def destroy
		    @event.destroy
---
DELETE FROM `events` WHERE `events`.`id` = 14

    	def search
		  query = params[:query]
		  events = Event.where('name LIKE ? OR place LIKE ? OR description LIKE ?',
		                       "%#{query}%", "%#{query}%", "%#{query}%")
---
SELECT `events`.* FROM `events` WHERE (name LIKE '%2%' OR place LIKE '%2%' OR description LIKE '%2%' OR event_date LIKE '%2%')

		def update
			if @event.update(event_params)
---
UPDATE `events` SET `description` = 'It\'s sample event witn number 78', `updated_at` = '2017-11-20 13:05:00' WHERE `events`.`id` = 7